In [16]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series,DataFrame

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,-7,-5,3],index=['d','b','a','c'])

In [8]:
obj2

d    4
b   -7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [13]:
obj2[obj2 > 0]

d    4
c    3
dtype: int64

In [14]:
obj2*2

d     8
b   -14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2)

d    54.598150
b     0.000912
a     0.006738
c    20.085537
dtype: float64

In [18]:
'b'in obj2

True

In [19]:
'e'in obj2

False

In [20]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [21]:
obj3 = pd.Series(sdata)

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [24]:
obj4 = pd.Series(sdata,index=states)

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
obj3  + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [33]:
obj4.name = 'population'

In [34]:
obj4.index.name = 'state'

In [35]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [36]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [37]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [38]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [39]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [40]:
frame = pd.DataFrame(data)

In [41]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [44]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [45]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [46]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [47]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [48]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [49]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [50]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [51]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [52]:
frame2['debt'] = 16.5

In [53]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [58]:
frame2['debt'] = np.arange(6.)

In [59]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [60]:
va1 = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [62]:
frame2['debt'] = va1

In [63]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [64]:
frame2['eastern'] = frame2.state == 'Ohio'

In [66]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [67]:
del frame2['eastern']

In [68]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [69]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [80]:
 pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [81]:
frame3 = pd.DataFrame(pop)

In [73]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [74]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [84]:
pd.DataFrame(pop,index=pd.Series([2001,2002,2003]))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [85]:
 pdata = {'Ohio': frame3['Ohio'][:-1],
          'Nevada': frame3['Nevada'][:2]}

In [86]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [87]:
frame3.index.name = 'year';frame3.columns.name = 'state'

In [88]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [89]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [90]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [91]:
obj = pd.Series(range(3),index=['a','b','c'])

In [92]:
index = obj.index

In [93]:
index

Index(['a', 'b', 'c'], dtype='object')

In [94]:
index[:1]

Index(['a'], dtype='object')

In [97]:
index[0] = "c"

TypeError: Index does not support mutable operations

In [100]:
labels = pd.Index(np.arange(3))

In [101]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [102]:
obj2 = pd.Series([1.5,-2.5,0],index=labels)

In [103]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [104]:
obj2.index is labels

True

In [105]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [106]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [107]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [108]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [109]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [110]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [111]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [113]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [114]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])

In [115]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [116]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [117]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a','c','d'],
                    columns=['Ohio','Texax','California'])

In [118]:
frame

   Ohio  Texax  California
a     0      1           2
c     3      4           5
d     6      7           8

In [119]:
frame2 = frame.reindex(['a','b','c','d'])

In [120]:
frame2

   Ohio  Texax  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [121]:
states = ['Texas','Utah','California']

In [122]:
frame.reindex(columns=states)

   Texas  Utah  California
a    NaN   NaN           2
c    NaN   NaN           5
d    NaN   NaN           8

In [123]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [124]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [125]:
new_obj = obj.drop('c')

In [126]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [127]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [128]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),                   
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [129]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data.drop('Utah')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [139]:
obj = pd.Series(np.arange(4.),index=['a','b','c','d'])

In [137]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [140]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [141]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [142]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [143]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [144]:
obj['b':'c'] = 5

In [145]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [146]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [147]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [148]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [149]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [150]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [151]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [152]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [153]:
data[data < 5] = 0

In [154]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [155]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [156]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [157]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [158]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [159]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [162]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [164]:
ser2 = pd.Series(np.arange(3.),index=['a','b','c'])

In [165]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [167]:
ser2[-1]

2.0

In [168]:
ser[:1]

0    0.0
dtype: float64

In [169]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [170]:
ser.iloc[:1]

0    0.0
dtype: float64

In [172]:
s1 = pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [173]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [174]:
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1],
              index=['a','c','e','f','g'])

In [175]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [176]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [177]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])

In [178]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [179]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [180]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [181]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [182]:
df1 = pd.DataFrame({'A':[1,2]})

In [183]:
df2 = pd.DataFrame({'B':[3,4]})

In [184]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))

In [185]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [186]:
 df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                    columns=list('abcde'))

In [187]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [188]:
df2.loc[1,'b'] = np.nan

In [189]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [190]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [191]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [192]:
1/df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [193]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [194]:
arr = np.arange(12.).reshape((3,4))

In [195]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [196]:
arr[0]

array([0., 1., 2., 3.])

In [197]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [199]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [200]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [202]:
series = frame.iloc[0]

In [203]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [204]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [205]:
series2 = pd.Series(range(3),index=['b','e','f'])

In [207]:
series2

b    0
e    1
f    2
dtype: int64

In [208]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [209]:
series3 = frame['d']

In [210]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [211]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [212]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [213]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [214]:
frame

               b         d         e
Utah   -0.757727  1.698078 -1.362334
Ohio   -0.392222  1.380093 -0.549550
Texas  -2.407430  0.094908 -1.031633
Oregon  1.501761  0.152255 -0.609533

In [215]:
np.abs(frame)

               b         d         e
Utah    0.757727  1.698078  1.362334
Ohio    0.392222  1.380093  0.549550
Texas   2.407430  0.094908  1.031633
Oregon  1.501761  0.152255  0.609533

In [216]:
f = lambda x:x.max() - x.min()

In [217]:
frame.apply(f)

b    3.909192
d    1.603170
e    0.812784
dtype: float64

In [218]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [219]:
frame.apply(f)

            b         d         e
min -2.407430  0.094908 -1.362334
max  1.501761  1.698078 -0.549550

In [220]:
format = lambda x:'%.2f'% x

In [221]:
frame.applymap(format)

            b     d      e
Utah    -0.76  1.70  -1.36
Ohio    -0.39  1.38  -0.55
Texas   -2.41  0.09  -1.03
Oregon   1.50  0.15  -0.61

In [222]:
frame['e'].map(format)

Utah      -1.36
Ohio      -0.55
Texas     -1.03
Oregon    -0.61
Name: e, dtype: object

In [223]:
obj = pd.Series(range(4),index=['d','a','b','c'])

In [224]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [228]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [229]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [230]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [231]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [232]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [233]:
obj = pd.Series([4,7,-3,2])

In [235]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [236]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [237]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [238]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [242]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [243]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [246]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [245]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [247]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [248]:
obj = pd.Series(range(5),index=['a','a','b','b','c'])

In [249]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [250]:
obj.index.is_unique

False

In [251]:
obj['a']

a    0
a    1
dtype: int64

In [252]:
obj['c']

4

In [253]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [254]:
df

          0         1         2
a -0.086431  0.671644  1.563163
a  1.617258  0.434034 -1.061300
b  0.554228  0.756268 -0.277368
b -2.653578  0.080042  1.237232

In [255]:
df.loc['b']

          0         1         2
b  0.554228  0.756268 -0.277368
b -2.653578  0.080042  1.237232

In [256]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [257]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [258]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [259]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [262]:
df.idxmax()

one    b
two    d
dtype: object

In [264]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [265]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [266]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [267]:
obj = pd.Series(['a','a','b','c'] * 4)

In [268]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [269]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [270]:
import pandas_datareader.data as web

In [271]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [272]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.478571   30.080000   30.447144   30.104286   88102700.0
 2010-01-04   30.642857   30.340000   30.490000   30.572857  123432400.0
 2010-01-05   30.798571   30.464285   30.657143   30.625713  150476200.0
 2010-01-06   30.747143   30.107143   30.625713   30.138571  138040000.0
 2010-01-07   30.285715   29.864286   30.250000   30.082857  119282800.0
 2010-01-08   30.285715   29.865715   30.042856   30.282858  111902700.0
 2010-01-11   30.428572   29.778572   30.400000   30.015715  115557400.0
 2010-01-12   29.967142   29.488571   29.884285   29.674286  148614900.0
 2010-01-13   30.132856   29.157143   29.695715   30.092857  151473000.0
 2010-01-14   30.065714   29.860001   30.015715   29.918571  108223500.0
 2010-01-15   30.228571   29.410000   30.132856   29.418571  148516900.0
 2010-01-19   30.741428   29.605715   29.761429   30.719999  182501900.0
 2010-01-20   30.792856   29.928572   30.701429   30.247143  153038200.0
 2010-01-21   30.472857   29.601429   30.297142   29.724285  152038600.0
 2010-01-22   29.642857   28.165714   29.540001   28.250000  220441900.0
 2010-01-25   29.242857   28.598572   28.930000   29.010000  266424900.0
 2010-01-26   30.530001   28.940001   29.421429   29.420000  466777500.0
 2010-01-27   30.082857   28.504286   29.549999   29.697144  430642100.0
 2010-01-28   29.357143   28.385714   29.275715   28.469999  293375600.0
 2010-01-29   28.885714   27.178572   28.725714   27.437143  311488100.0
 2010-02-01   28.000000   27.328571   27.481428   27.818571  187469100.0
 2010-02-02   28.045713   27.625713   27.987143   27.980000  174585600.0
 2010-02-03   28.600000   27.774286   27.881428   28.461428  153832000.0
 2010-02-04   28.338572   27.367144   28.104286   27.435715  189413000.0
 2010-02-05   28.000000   27.264286   27.518572   27.922857  212576700.0
 2010-02-08   28.268572   27.714285   27.955715   27.731428  119567700.0
 2010-02-09   28.214285   27.821428   28.059999   28.027143  158221700.0
 2010-02-10   28.085714   27.751429   27.984285   27.874287   92590400.0
 2010-02-11   28.535715   27.722857   27.840000   28.381428  137586400.0
 2010-02-12   28.805714   27.928572   28.301428   28.625713  163867200.0
 ...                ...         ...         ...         ...          ...
 2019-03-29  190.080002  188.539993  189.830002  189.949997   23564000.0
 2019-04-01  191.679993  188.380005  191.639999  191.240005   27862000.0
 2019-04-02  194.460007  191.050003  191.089996  194.020004   22765700.0
 2019-04-03  196.500000  193.149994  193.250000  195.350006   23271800.0
 2019-04-04  196.369995  193.139999  194.789993  195.690002   19114300.0
 2019-04-05  197.100006  195.929993  196.449997  197.000000   18526600.0
 2019-04-08  200.229996  196.339996  196.419998  200.100006   25881700.0
 2019-04-09  202.850006  199.229996  200.320007  199.500000   35768200.0
 2019-04-10  200.740005  198.179993  198.679993  200.619995   21695300.0
 2019-04-11  201.000000  198.440002  200.850006  198.949997   20900800.0
 2019-04-12  200.139999  196.210007  199.199997  198.869995   27760700.0
 2019-04-15  199.850006  198.009995  198.580002  199.229996   17536600.0
 2019-04-16  201.369995  198.559998  199.460007  199.250000   25696400.0
 2019-04-17  203.380005  198.610001  199.539993  203.130005   28906800.0
 2019-04-18  204.149994  202.520004  203.119995  203.860001   24195800.0
 2019-04-22  204.940002  202.339996  202.830002  204.529999   19439500.0
 2019-04-23  207.750000  203.899994  204.429993  207.479996   23323000.0
 2019-04-24  208.479996  207.050003  207.360001  207.160004   17540600.0
 2019-04-25  207.759995  205.119995  206.830002  205.279999   18543200.0
 2019-04-26  205.000000  202.119995  204.899994  204.300003   18649100.0
 2019-04-29  205.970001  203.860001  204.399994  204.610001   22204700.0
 2019-04-30  203.399994  199.110001  203.059998  200.669998   46534900.0
 2019-05-01  215.309998  209.229996  209.880005  210.520004   64827300.0
 2019-05-02  212.649994  208.130005  209.839996  209.149994   31996300.0
 2019-05-03  211.839996  210.229996  210.889999  211.750000   20892400.0
 2019-05-06  208.839996  203.500000  204.289993  208.479996   32443100.0
 2019-05-07  207.419998  200.830002  205.880005  202.860001   38763700.0
 2019-05-08  205.339996  201.750000  201.899994  202.899994   26339500.0
 2019-05-09  201.679993  196.660004  200.399994  200.720001   34908600.0
 2019-05-10  198.850006  192.770004  197.419998  197.179993   41183400.0

              Adj Close
 Date
 2009-12-31   19.996618
 2010-01-04   20.307869
 2010-01-05   20.342979
 2010-01-06   20.019398
 2010-01-07   19.982389
 2010-01-08   20.115240
 2010-01-11   19.937790
 2010-01-12   19.710993
 2010-01-13   19.989031
 2010-01-14   19.873259
 2010-01-15   19.541140
 2010-01-19   20.405605
 2010-01-20   20.091518
 2010-01-21   19.744209
 2010-01-22   18.764919
 2010-01-25   19.269749
 2010-01-26   19.542088
 2010-01-27   19.726181
 2010-01-28   18.911057
 2010-01-29   18.224987
 2010-02-01   18.478348
 2010-02-02   18.585581
 2010-02-03   18.905357
 2010-02-04   18.224039
 2010-02-05   18.547623
 2010-02-08   18.420462
 2010-02-09   18.616892
 2010-02-10   18.515354
 2010-02-11   18.852224
 2010-02-12   19.014488
 ...                ...
 2019-03-29  189.221313
 2019-04-01  190.506363
 2019-04-02  193.275696
 2019-04-03  194.600601
 2019-04-04  194.939301
 2019-04-05  196.244263
 2019-04-08  199.332382
 2019-04-09  198.734680
 2019-04-10  199.850372
 2019-04-11  198.186783
 2019-04-12  198.107086
 2019-04-15  198.465714
 2019-04-16  198.485641
 2019-04-17  202.350754
 2019-04-18  203.077957
 2019-04-22  203.745377
 2019-04-23  206.684052
 2019-04-24  206.365295
 2019-04-25  204.492508
 2019-04-26  203.516266
 2019-04-29  203.825073
 2019-04-30  199.900192
 2019-05-01  209.712402
 2019-05-02  208.347656
 2019-05-03  210.937683
 2019-05-06  207.680222
 2019-05-07  202.081787
 2019-05-08  202.121628
 2019-05-09  199.949997
 2019-05-10  197.179993

 [2355 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0
 2010-01-04  132.970001  130.850006  131.179993  132.449997   6155300.0
 2010-01-05  131.850006  130.100006  131.679993  130.850006   6841400.0
 2010-01-06  131.490005  129.809998  130.679993  130.000000   5605300.0
 2010-01-07  130.250000  128.910004  129.869995  129.550003   5840600.0
 2010-01-08  130.919998  129.050003  129.070007  130.850006   4197200.0
 2010-01-11  131.059998  128.669998  131.059998  129.479996   5730400.0
 2010-01-12  131.330002  129.000000  129.029999  130.509995   8081500.0
 2010-01-13  131.119995  129.160004  130.389999  130.229996   6455400.0
 2010-01-14  132.710007  129.910004  130.550003  132.309998   7111800.0
 2010-01-15  132.889999  131.089996  132.029999  131.779999   8494400.0
 2010-01-19  134.250000  131.559998  131.630005  134.139999  13916200.0
 2010-01-20  131.149994  128.949997  130.460007  130.250000  15197500.0
 2010-01-21  130.690002  128.059998  130.470001  129.000000   9608600.0
 2010-01-22  128.889999  125.370003  128.669998  125.500000  10088600.0
 2010-01-25  126.889999  125.709999  126.330002  126.120003   5738500.0
 2010-01-26  127.750000  125.410004  125.919998  125.750000   7135300.0
 2010-01-27  126.959999  125.040001  125.820000  126.330002   8719200.0
 2010-01-28  127.040001  123.050003  127.029999  123.750000   9622200.0
 2010-01-29  125.000000  121.900002  124.320000  122.389999  11571200.0
 2010-02-01  124.949997  122.779999  123.230003  124.669998   7242900.0
 2010-02-02  125.809998  123.949997  124.790001  125.529999   5899900.0
 2010-02-03  126.070000  125.070000  125.160004  125.660004   4177100.0
 2010-02-04  125.440002  122.900002  125.190002  123.000000   9126900.0
 2010-02-05  123.720001  121.830002  123.040001  123.519997   8617000.0
 2010-02-08  123.220001  121.739998  123.150002  121.879997   5718500.0
 2010-02-09  124.199997  122.459999  122.650002  123.209999   6044500.0
 2010-02-10  123.650002  122.209999  122.940002  122.809998   5219100.0
 2010-02-11  124.199997  122.059998  122.580002  123.730003   5089000.0
 2010-02-12  124.050003  121.610001  123.010002  124.000000   8017700.0
 ...                ...         ...         ...         ...         ...
 2019-03-29  141.220001  140.149994  140.500000  141.100006   3101400.0
 2019-04-01  143.410004  141.509995  141.509995  143.300003   3984300.0
 2019-04-02  143.949997  142.600006  143.350006  143.000000   2404800.0
 2019-04-03  144.220001  143.009995  143.649994  143.630005   2681200.0
 2019-04-04  144.139999  142.539993  143.619995  142.779999   2771100.0
 2019-04-05  143.500000  142.460007  143.289993  143.279999   2731800.0
 2019-04-08  143.419998  142.869995  143.020004  143.389999   2118200.0
 2019-04-09  142.949997  141.839996  142.660004  142.110001   3038500.0
 2019-04-10  143.500000  141.979996  142.199997  143.020004   2678000.0
 2019-04-11  144.110001  143.029999  143.800003  143.779999   2942000.0
 2019-04-12  144.440002  143.699997  144.259995  144.350006   2898900.0
 2019-04-15  144.460007  143.270004  144.399994  143.899994   3603200.0
 2019-04-16  145.389999  144.020004  144.399994  145.139999   6301700.0
 2019-04-17  141.979996  136.259995  137.369995  139.110001  12525700.0
 2019-04-18  140.490005  138.699997  139.000000  140.330002   4960000.0
 2019-04-22  140.559998  138.479996  139.419998  138.889999   4494000.0
 2019-04-23  140.919998  138.940002  139.149994  140.440002   4462200.0
 2019-04-24  141.309998  139.779999  140.600006  139.949997   2774900.0
 2019-04-25  139.750000  137.710007  139.699997  138.630005   2910100.0
 2019-04-26  139.889999  138.809998  139.339996  139.440002   2319800.0
 2019-04-29  139.630005  138.809998  139.149994  139.050003   2958300.0
 2019-04-30  140.440002  138.679993  139.110001  140.270004   4638800.0
 2019-05-01  141.809998  140.169998  140.550003  140.559998   3053700.0
 2019-05-02  141.279999  139.410004  140.500000  139.589996   3541400.0
 2019-05-03  141.000000  139.630005  139.699997  140.250000   2579900.0
 2019-05-06  140.690002  137.899994  138.300003  140.380005   2793300.0
 2019-05-07  139.509995  136.190002  139.149994  137.639999   4726800.0
 2019-05-08  138.699997  137.130005  137.770004  138.000000   3818900.0
 2019-05-09  135.580002  133.029999  134.889999  135.339996   4192700.0
 2019-05-10  135.750000  132.419998  134.880005  135.320007   3977600.0

              Adj Close
 Date
 2009-12-31   98.137283
 2010-01-04   99.299347
 2010-01-05   98.099792
 2010-01-06   97.462532
 2010-01-07   97.125160
 2010-01-08   98.099792
 2010-01-11   97.072685
 2010-01-12   97.844872
 2010-01-13   97.634964
 2010-01-14   99.194389
 2010-01-15   98.797028
 2010-01-19  100.566330
 2010-01-20   97.649979
 2010-01-21   96.712860
 2010-01-22   94.088844
 2010-01-25   94.553688
 2010-01-26   94.276276
 2010-01-27   94.711105
 2010-01-28   92.776848
 2010-01-29   91.757233
 2010-02-01   93.466576
 2010-02-02   94.111336
 2010-02-03   94.208817
 2010-02-04   92.214569
 2010-02-05   92.604401
 2010-02-08   91.783577
 2010-02-09   92.785126
 2010-02-10   92.483902
 2010-02-11   93.176750
 2010-02-12   93.380051
 ...                ...
 2019-03-29  139.443619
 2019-04-01  141.617783
 2019-04-02  141.321304
 2019-04-03  141.943909
 2019-04-04  141.103882
 2019-04-05  141.598022
 2019-04-08  141.706726
 2019-04-09  140.441757
 2019-04-10  141.341080
 2019-04-11  142.092148
 2019-04-12  142.655457
 2019-04-15  142.210739
 2019-04-16  143.436188
 2019-04-17  137.476974
 2019-04-18  138.682648
 2019-04-22  137.259552
 2019-04-23  138.791351
 2019-04-24  138.307098
 2019-04-25  137.002609
 2019-04-26  137.803101
 2019-04-29  137.417679
 2019-04-30  138.623352
 2019-05-01  138.909943
 2019-05-02  137.951324
 2019-05-03  138.603592
 2019-05-06  138.732071
 2019-05-07  136.024231
 2019-05-08  136.380005
 2019-05-09  135.339996
 2019-05-10  135.320007

 [2355 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.990000   30.480000   30.980000   30.480000   31929700.0
 2010-01-04   31.100000   30.590000   30.620001   30.950001   38409100.0
 2010-01-05   31.100000   30.639999   30.850000   30.959999   49749600.0
 2010-01-06   31.080000   30.520000   30.879999   30.770000   58182400.0
 2010-01-07   30.700001   30.190001   30.629999   30.450001   50559700.0
 2010-01-08   30.879999   30.240000   30.280001   30.660000   51197400.0
 2010-01-11   30.760000   30.120001   30.709999   30.270000   68754700.0
 2010-01-12   30.400000   29.910000   30.150000   30.070000   65912100.0
 2010-01-13   30.520000   30.010000   30.260000   30.350000   51863500.0
 2010-01-14   31.100000   30.260000   30.309999   30.959999   63228100.0
 2010-01-15   31.240000   30.709999   31.080000   30.860001   79913200.0
 2010-01-19   31.240000   30.680000   30.750000   31.100000   46575700.0
 2010-01-20   30.940001   30.309999   30.809999   30.590000   54849500.0
 2010-01-21   30.719999   30.000000   30.610001   30.010000   73086700.0
 2010-01-22   30.200001   28.840000   30.000000   28.959999  102004600.0
 2010-01-25   29.660000   29.100000   29.240000   29.320000   63373000.0
 2010-01-26   29.850000   29.090000   29.200001   29.500000   66639900.0
 2010-01-27   29.820000   29.020000   29.350000   29.670000   63949500.0
 2010-01-28   29.870001   28.889999   29.840000   29.160000  117513700.0
 2010-01-29   29.920000   27.660000   29.900000   28.180000  193888500.0
 2010-02-01   28.480000   27.920000   28.389999   28.410000   85931100.0
 2010-02-02   28.500000   28.139999   28.370001   28.459999   54413700.0
 2010-02-03   28.790001   28.120001   28.260000   28.629999   61397900.0
 2010-02-04   28.500000   27.809999   28.379999   27.840000   77850000.0
 2010-02-05   28.280001   27.570000   28.000000   28.020000   80960100.0
 2010-02-08   28.080000   27.570000   28.010000   27.719999   52820600.0
 2010-02-09   28.340000   27.750000   27.969999   28.010000   59195800.0
 2010-02-10   28.240000   27.840000   28.030001   27.990000   48591300.0
 2010-02-11   28.400000   27.700001   27.930000   28.120001   65993700.0
 2010-02-12   28.059999   27.580000   27.809999   27.930000   81117200.0
 ...                ...         ...         ...         ...          ...
 2019-03-29  118.320000  116.959999  118.070000  117.940002   25399800.0
 2019-04-01  119.110001  118.099998  118.949997  119.019997   22789100.0
 2019-04-02  119.480003  118.519997  119.059998  119.190002   18142300.0
 2019-04-03  120.430000  119.150002  119.860001  119.970001   22860700.0
 2019-04-04  120.230003  118.379997  120.099998  119.360001   20112800.0
 2019-04-05  120.230003  119.370003  119.389999  119.889999   15826200.0
 2019-04-08  120.019997  118.639999  119.809998  119.930000   15116200.0
 2019-04-09  119.540001  118.580002  118.629997  119.279999   17612000.0
 2019-04-10  120.349998  119.540001  119.760002  120.190002   16477200.0
 2019-04-11  120.849998  119.919998  120.540001  120.330002   14209100.0
 2019-04-12  120.980003  120.370003  120.639999  120.949997   19745100.0
 2019-04-15  121.580002  120.570000  120.940002  121.050003   15792600.0
 2019-04-16  121.650002  120.099998  121.639999  120.769997   14071800.0
 2019-04-17  121.849998  120.540001  121.239998  121.769997   19300900.0
 2019-04-18  123.519997  121.300003  122.190002  123.370003   27991000.0
 2019-04-22  124.000000  122.570000  122.620003  123.760002   15648700.0
 2019-04-23  125.580002  123.830002  124.099998  125.440002   24025500.0
 2019-04-24  125.849998  124.519997  125.790001  125.010002   31257000.0
 2019-04-25  131.369995  128.830002  130.059998  129.149994   38033900.0
 2019-04-26  130.520004  129.020004  129.699997  129.889999   23654900.0
 2019-04-29  130.179993  129.350006  129.899994  129.770004   16324200.0
 2019-04-30  130.699997  129.389999  129.809998  130.600006   24166500.0
 2019-05-01  130.649994  127.699997  130.529999  127.879997   26821700.0
 2019-05-02  128.000000  125.519997  127.980003  126.209999   27350200.0
 2019-05-03  129.429993  127.250000  127.360001  128.899994   24911100.0
 2019-05-06  128.559998  126.110001  126.389999  128.149994   24239800.0
 2019-05-07  127.180000  124.220001  126.459999  125.519997   36017700.0
 2019-05-08  126.370003  124.750000  125.440002  125.510002   28419000.0
 2019-05-09  125.790001  123.570000  124.290001  125.500000   27235800.0
 2019-05-10  127.930000  123.820000  124.910004  127.129997   30905300.0

              Adj Close
 Date
 2009-12-31   24.241983
 2010-01-04   24.615801
 2010-01-05   24.623755
 2010-01-06   24.472631
 2010-01-07   24.218124
 2010-01-08   24.385145
 2010-01-11   24.074966
 2010-01-12   23.915895
 2010-01-13   24.138592
 2010-01-14   24.623755
 2010-01-15   24.544212
 2010-01-19   24.735104
 2010-01-20   24.329473
 2010-01-21   23.868181
 2010-01-22   23.033073
 2010-01-25   23.319397
 2010-01-26   23.462553
 2010-01-27   23.597769
 2010-01-28   23.192135
 2010-01-29   22.412704
 2010-02-01   22.595629
 2010-02-02   22.635405
 2010-02-03   22.770605
 2010-02-04   22.142290
 2010-02-05   22.285454
 2010-02-08   22.046848
 2010-02-09   22.277498
 2010-02-10   22.261591
 2010-02-11   22.364988
 2010-02-12   22.213871
 ...                ...
 2019-03-29  117.940002
 2019-04-01  119.019997
 2019-04-02  119.190002
 2019-04-03  119.970001
 2019-04-04  119.360001
 2019-04-05  119.889999
 2019-04-08  119.930000
 2019-04-09  119.279999
 2019-04-10  120.190002
 2019-04-11  120.330002
 2019-04-12  120.949997
 2019-04-15  121.050003
 2019-04-16  120.769997
 2019-04-17  121.769997
 2019-04-18  123.370003
 2019-04-22  123.760002
 2019-04-23  125.440002
 2019-04-24  125.010002
 2019-04-25  129.149994
 2019-04-26  129.889999
 2019-04-29  129.770004
 2019-04-30  130.600006
 2019-05-01  127.879997
 2019-05-02  126.209999
 2019-05-03  128.899994
 2019-05-06  128.149994
 2019-05-07  125.519997
 2019-05-08  125.510002
 2019-05-09  125.500000
 2019-05-10  127.129997

 [2355 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close      Volume  \
 Date
 2009-12-31   310.679321   307.986847   310.356445   307.986847   2455400.0
 2010-01-04   312.721039   310.103088   311.449310   311.349976   3937800.0
 2010-01-05   311.891449   308.761810   311.563568   309.978882   6048500.0
 2010-01-06   310.907837   301.220856   310.907837   302.164703   8009000.0
 2010-01-07   303.029083   294.410156   302.731018   295.130463  12912000.0
 2010-01-08   299.675903   292.651581   294.087250   299.064880   9509900.0
 2010-01-11   300.276978   295.100647   300.276978   298.612823  14519600.0
 2010-01-12   297.147339   292.100159   296.893982   293.332153   9769600.0
 2010-01-13   292.288940   285.095734   286.382355   291.648102  13077600.0
 2010-01-14   295.180145   289.521942   290.063416   293.019196   8535300.0
 2010-01-15   294.862213   287.152344   294.752930   288.126007  10939600.0
 2010-01-19   293.302338   286.283020   288.722137   291.911407   8689500.0
 2010-01-20   291.096710   285.786224   291.096710   288.329681   6543600.0
 2010-01-21   291.513977   284.276062   289.834900   289.606384  12697400.0
 2010-01-22   283.456390   265.701874   280.426086   273.227905  13689200.0
 2010-01-25   273.163330   266.024780   271.528961   268.255249   8897200.0
 2010-01-26   273.024231   266.412231   267.246826   269.457428   8767600.0
 2010-01-27   272.055542   265.925415   268.886169   269.298462   7980200.0
 2010-01-28   271.732635   263.585632   270.485748   265.418701   6500100.0
 2010-01-29   268.747070   261.106750   267.505127   263.257751   8334700.0
 2010-02-01   266.173798   263.436584   265.572693   264.787811   4530800.0
 2010-02-02   265.751556   262.100281   265.751556   263.843964   8245600.0
 2010-02-03   269.298462   262.408295   262.626862   268.662598   6037000.0

In [273]:
returns = price.pct_change()

In [275]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-05-06 -0.015443  0.000927 -0.005818  0.003366
2019-05-07 -0.026957 -0.019518 -0.020523 -0.012855
2019-05-08  0.000197  0.002616 -0.000080 -0.006669
2019-05-09 -0.010744 -0.007626 -0.000080 -0.003335
2019-05-10 -0.013853 -0.000148  0.012988  0.001626

In [277]:
returns['MSFT'].corr(returns['IBM'])

0.48565223570590677

In [278]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.370686  0.448227  0.455828
IBM   0.370686  1.000000  0.485652  0.403451
MSFT  0.448227  0.485652  1.000000  0.534356
GOOG  0.455828  0.403451  0.534356  1.000000

In [279]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000269  0.000075  0.000106  0.000115
IBM   0.000075  0.000151  0.000086  0.000077
MSFT  0.000106  0.000086  0.000209  0.000119
GOOG  0.000115  0.000077  0.000119  0.000238

In [280]:
returns.corrwith(returns.IBM)

AAPL    0.370686
IBM     1.000000
MSFT    0.485652
GOOG    0.403451
dtype: float64

In [281]:
returns.corrwith(volume)

AAPL   -0.060065
IBM    -0.155818
MSFT   -0.089679
GOOG   -0.020541
dtype: float64

In [282]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [283]:
uniques = obj.unique()

In [284]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [285]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [289]:
pd.value_counts(obj.values,sort=False)

d    1
c    3
b    2
a    3
dtype: int64

In [290]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [291]:
mask = obj.isin(['b','c'])

In [292]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [293]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [294]:
to_math = pd.Series(['c','a','b','b','c','a'])

In [296]:
unique_vals = pd.Series(['c','b','a'])

In [301]:
pd.Index(unique_vals).get_indexer(to_math)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [302]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [303]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [304]:
result = data.apply(pd.value_counts).fillna(0)

In [305]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0